Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/удуГруппыУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуГруппыУчреждения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Вместительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсирующаяНаправленность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезОграниченияВместительности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленностьГруппы</name>
    <type>
      <types>EnumRef.удуТипыНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияНаправленности</name>
    <type>
      <types>CatalogRef.удуДетализацияНаправленностиГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастнойПризнак</name>
    <type>
      <types>CatalogRef.удуВозрастныеПризнаки</types>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВоспитательныйПерсонал</name>
    <attributes>
      <name>РаботникУчреждения</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуДоговорОЗачисленииРебенка/удуДоговорОЗачисленииРебенка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуДоговорОЗачисленииРебенка</name>
  <basedOn>Document.удуЗаявкаНаЗачислениеРебенкаВДОУ</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.удуРодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоЗачисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизошлоОтчисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакФормированияБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОснование</name>
    <type>
      <types>DocumentRef.удуЗаявкаНаЗачислениеРебенкаВДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиОплаты</name>
    <type>
      <types>EnumRef.удуВидыСтавокРодительскойПлаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОрганВыдавшийДокумент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Catalogs/удуГруппыУчреждения/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ВернутьСтатусСостоитВГруппе()
	Возврат Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("Группа", Элементы.Список.ТекущаяСтрока);
	СписокДетейГруппы.Параметры.УстановитьЗначениеПараметра("СостояниеУчетаВГруппе", ВернутьСтатусСостоитВГруппе());
КонецПроцедуры

&НаКлиенте
Процедура СписокДетейГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "Ребенок" Тогда
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ребенок);
		ОткрытьФормуМодально("Справочник.удуДети.Форма.ФормаЭлемента", ПередаваемыеПараметры, ЭтаФорма);
	ИначеЕсли Поле.Имя = "ОснованиеЗачисления" Тогда
		СтандартнаяОбработка = Ложь;
		ПередаваемыеПараметры = Новый Структура("Ключ", Элемент.ТекущиеДанные.ОснованиеЗачисления);
		ОткрытьФормуМодально("Документ.удуДоговорОЗачисленииРебенка.Форма.ФормаДокумента", ПередаваемыеПараметры, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Учреждение = Константы.удуОсновноеУчреждение.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура УчреждениеПриИзменении(Элемент)
	УстановитьОтборПоУчреждению();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУчреждению()
	Список.Параметры.УстановитьЗначениеПараметра("Учреждение", Учреждение);
	Дерево.Параметры.УстановитьЗначениеПараметра("Учреждение", Учреждение);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если не Группа Тогда
		Отказ=Истина;
		ОткрытьФорму("Справочник.удуГруппыУчреждения.Форма.ФормаЭлемента",Новый Структура("Учреждение, Родитель",Учреждение, Элементы.Дерево.ТекущаяСтрока),Элементы.Список);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборПоУчреждению();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если не Группа Тогда
		Отказ=Истина;
		ОткрытьФорму("Справочник.удуГруппыУчреждения.Форма.ФормаЭлемента",Новый Структура("Учреждение, Родитель",Учреждение, Элементы.Дерево.ТекущаяСтрока),Элементы.Список);	
	КонецЕсли;	
КонецПроцедуры
